#+TITLE: GNN vs. Classificadores Tradicionais — Dataset Planetoid (Cora/CiteSeer)
#+AUTHOR: Nícolas Rosenthal Dal Corso
#+PROPERTY: header-args:python :session planetoid
#+OPTIONS: toc:2 num:t

* Configuração
#+begin_src python :results output verbatim
import sys
sys.path.insert(0, "..")   # raiz do projeto, para importar src/

import numpy as np
import pandas as pd

import matplotlib
matplotlib.use('Agg')   # Deve vir antes de importar matplotlib.pyplot
import matplotlib.pyplot as plt
import matplotlib.ticker as mticker
import torch
import torch.nn.functional as F
from torch_geometric.datasets import Planetoid
from torch_geometric.transforms import NormalizeFeatures
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
from sklearn.metrics import classification_report, accuracy_score

plt.rcParams["figure.dpi"] = 110
plt.rcParams["figure.figsize"] = (8, 5)

DEVICE = torch.device('cuda' if torch.cuda.is_available() else 'cpu')
print(f"Device: {DEVICE}")
#+end_src

#+RESULTS:
: Device: cpu

